// Напишите программу, которая задаёт 2 одномерных массива из N элементов 
// которые заполняются случайными значениями в диапазоне от 1 до 10 и находит 
// среднее арифметическое элементов этих 2 массивов, далее от большего из получившихся 
// средних арифметических отнимаем меньшее и округлённый до целого числа результат переводим 
// в двоичную систему счисления.

// [1,2,3,4] [3,6,4] -> округлённая до целого числа разница между средними арифметическими массивов = 2. 2 
// в двоичной системе счисления = 10

// [4,7,9] [3,3,1,2,2] -> округлённая до целого числа разница между средними арифметическими массивов = 4. 4 
// в двоичной системе счисления = 100