// Задайте одномерный массив, заполненный случайными числами. 
// Из входного массива сформируйте массив с чётными и массив с нечётными значениями элементов входного массива. 
// Найдите ср. арифметическое из полученных значений элементов массивов и выведите результат 
// сравнения средних арифметических.

// [1,2,3,4] -> средн. арифм. значений элементов массива 
// с чётными числами > средн. арифм. значений элементов с нечётными числами.

//[2,3,5,7] -> средн. арифм. массива значений элементов 
// с нечётными числами > средн. арифм. значений элементов с чётными числами

//[1,2,5,4] -> средн. арифм. значений элементов массива 
// с нечётными числами = средн. арифм. значений элементов с чётными числами